# Структура квиза
#1.  question - вопрос
#2.  options - варианты ответов
#3.  correct_option - индекс правильного ответа

quiz_data = [
    { # question 1
        'question': 'Как вы предпочитаете проводить свободное время?',
        'options': [
            'В кругу друзей, на вечеринке.', 
            'С книгой или любимым сериалом.', 
            'Занимаясь хобби или изучая что-то новое.', 
            'На свежем воздухе, занимаясь спортом или путешествуя.'
        ],
        'correct_option':  ['A','B','C','D'] 
    },
    { # question 2
        'question': 'Как вы реагируете на конфликтные ситуации?',
        'options': [
            'Стремлюсь найти компромисс.', 
            'Предпочитаю избегать конфликта.', 
            'Отстаиваю свою позицию до конца.', 
            'Действую в зависимости от ситуации.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 3
        'question': 'Как вы относитесь к неожиданным изменениям?',
        'options': [
            'Принимаю их с энтузиазмом.', 
            'Меня это немного пугает, но я приспосабливаюсь.', 
            'Сначала сопротивляюсь, но потом принимаю.', 
            'Планирую свои действия, чтобы контролировать изменения.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 4
        'question': 'Какой вид работы вам больше по душе?',
        'options': [
            'Работа в команде, где можно обмениваться идеями.', 
            'Работа в одиночку, где я могу сосредоточиться.', 
            'Работа, требующая творчества и нестандартного подхода.', 
            'Работа, где важны организованность и точность.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 5
        'question': 'Как вы относитесь к риску?',
        'options': [
            'Люблю рисковать и пробовать новое.', 
            'Предпочитаю избегать риска.', 
            'Рискую, если уверен в своих силах.', 
            'Принимаю риск, только если он оправдан.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 6
        'question': 'Как вы принимаете важные решения?',
        'options': [
            'Быстро и на основе интуиции.', 
            'Обдумываю все варианты и выбираю лучший.', 
            'Спрашиваю совета у других, чтобы убедиться.', 
            'Провожу анализ и расчет всех возможных исходов.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 7
        'question': 'Как вы ведете себя в новой компании?',
        'options': [
            'Быстро нахожу общий язык и завожу новых друзей.', 
            'Наблюдаю, прежде чем вступить в разговор.', 
            'Охотно делюсь своими мыслями и идеями.', 
            'Предпочитаю быть на вторых ролях, но поддерживать общение.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 8
        'question': 'Что для вас важнее в жизни?',
        'options': [
            'Общение и взаимоотношения с людьми.', 
            'Внутреннее спокойствие и гармония.', 
            'Личностное развитие и самореализация.', 
            'Достижения и успехи в карьере.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 9
        'question': 'Как вы относитесь к критике?',
        'options': [
            'Принимаю её как возможность стать лучше.', 
            'Критику воспринимаю болезненно.', 
            'Сначала обижаюсь, но потом осознаю её ценность.', 
            'Критику анализирую и стараюсь использовать для улучшения.'
        ],
        'correct_option':  ['A','B','C','D']
    },
    { # question 10
        'question': 'Какой тип людей вам ближе?',
        'options': [
            'Открытые и дружелюбные.', 
            'Спокойные и вдумчивые.', 
            'Креативные и нестандартные.', 
            'Целеустремленные и организованные.'
        ],
        'correct_option': ['A','B','C','D']
    }
]
